infra/benchmarks/results/20260818-123509/01_baseline_c1_i128_o64/client.log
/usr/local/lib/python3.12/dist-packages/transformers/utils/hub.py:105: FutureWarning: Using `TRANSFORMERS_CACHE` is deprecated and will be removed in v5 of Transformers. Use `HF_HOME` instead.
  warnings.warn(
INFO 08-18 12:35:42 [__init__.py:243] No platform detected, vLLM is running on UnspecifiedPlatform
Namespace(backend='openai-chat', base_url='http://10.1.1.238:50380', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', dataset_name='random', dataset_path=None, max_concurrency=1, model='/home/u001013/.cache/llm-serving/huggingface/hub/models--Qwen--Qwen2.5-72B-Instruct/snapshots/495f39366efef23836d0cfae4fbe635880d2be31', tokenizer='/home/u001013/.cache/llm-serving/huggingface/hub/models--Qwen--Qwen2.5-72B-Instruct/snapshots/495f39366efef23836d0cfae4fbe635880d2be31', use_beam_search=False, num_prompts=12, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=['case=01_baseline_c1_i128_o64', 'input_len=128', 'output_len=64', 'serving_run_id=20260818-111259-1292391', 'tp=4', 'pp=2', 'gpu=V100-SXM2-32GB'], result_dir='/home/u001013/llm_serving/benchmarks/results/20260818-123509/01_baseline_c1_i128_o64', result_filename='client.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=64, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='qwen2.5-72b', lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 12/12 [00:53<00:00,  4.43s/it]
============ Serving Benchmark Result ============
Successful requests:                     12        
Benchmark duration (s):                  53.11     
Total input tokens:                      1536      
Total generated tokens:                  768       
Request throughput (req/s):              0.23      
Output token throughput (tok/s):         14.46     
Total Token throughput (tok/s):          43.38     
---------------Time to First Token----------------
Mean TTFT (ms):                          171.67    
Median TTFT (ms):                        171.72    
P50 TTFT (ms):                           171.72    
P90 TTFT (ms):                           172.55    
P95 TTFT (ms):                           173.06    
P99 TTFT (ms):                           173.55    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          67.52     
Median TPOT (ms):                        67.50     
P50 TPOT (ms):                           67.50     
P90 TPOT (ms):                           67.64     
P95 TPOT (ms):                           67.66     
P99 TPOT (ms):                           67.68     
---------------Inter-token Latency----------------
Mean ITL (ms):                           66.46     
Median ITL (ms):                         67.45     
P50 ITL (ms):                            67.45     
P90 ITL (ms):                            67.83     
P95 ITL (ms):                            68.04     
P99 ITL (ms):                            68.56     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4425.42   
Median E2EL (ms):                        4424.16   
P50 E2EL (ms):                           4424.16   
P90 E2EL (ms):                           4431.70   
P95 E2EL (ms):                           4433.88   
P99 E2EL (ms):                           4435.91   
==================================================